renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_glcdc_rx/src/r_glcdc_private.h
/***********************************************************************************************************************
 * DISCLAIMER
 * This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
 * other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
 * applicable laws, including copyright laws.
 * THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
 * THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
 * EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
 * SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
 * SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
 * this software. By using this software, you agree to the additional terms and conditions found by accessing the
 * following link:
 * http://www.renesas.com/disclaimer
 *
 * Copyright (C) 2019-2020 Renesas Electronics Corporation. All rights reserved.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * File Name    : r_glcdc_private.h
 * Version      : 1.40
 * Description  : Header file of GLCDC internal functions.
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * History : DD.MM.YYYY Version  Description
 *         : 01.10.2017 1.00      First Release
 *         : 04.04.2019 1.10      Added support for GNUC and ICCRX.
 *         : 09.04.2019 1.20      Added support for RX72M.
 *         : 20.09.2019 1.30      Added support for RX72N and RX66N.
 *                                Deleted BG_PLANE_H_FRONT_PORCH_MAX and BG_PLANE_V_FRONT_PORCH_MAX.
 *                                Added BG_BGSYNC_HP_MAX and BG_BGSYNC_VP_MAX to extend the range of front porch.
 *         : 30.06.2020 1.40      Removed include in r_glcdc_rx_config.h.
 *                                Added prototype declaration of r_glcdc_qe_parameters_setting function
 *                                and callback function.
 *                                Added definition of GLCDC_PRV_PCALLBACK and extern declaration of CLUT table.
 **********************************************************************************************************************/

#ifndef R_GLCDC_PRIVATE_H
#define R_GLCDC_PRIVATE_H

/***********************************************************************************************************************
 Includes   <System Includes> , "Project Includes"
 **********************************************************************************************************************/
#include <stddef.h>
#include <stdint.h>

#include "platform.h"

#include "r_glcdc_rx_if.h"

/* This checks that the module of the GLCDC is supported to the MCU that has been selected for sure. */
#if ((defined(BSP_MCU_RX65N_2MB))||(defined(BSP_MCU_RX72M))||(defined(BSP_MCU_RX72N))||(defined(BSP_MCU_RX66N)))
#else
#error "This MCU is not supported by the current r_glcdc_rx module."
#endif

#if ((GLCDC_CFG_PARAM_CHECKING_ENABLE == 0) || (GLCDC_CFG_PARAM_CHECKING_ENABLE == 1))
#else
#error "ERROR- GLCDC_CFG_PARAM_CHECKING_ENABLE - setting values is out of range defined in r_glcdc_rx_config.h."
#endif

#if ((GLCDC_CFG_INTERRUPT_PRIORITY_LEVEL >= 0) && (GLCDC_CFG_INTERRUPT_PRIORITY_LEVEL <= 15))
#else
#error "ERROR- GLCDC_CFG_INTERRUPT_PRIORITY_LEVEL - setting values is out of range defined in r_glcdc_rx_config.h."
#endif

#if (R_BSP_VERSION_MAJOR < 5)
#error "This module must use BSP module of Rev.5.00 or higher. Please use the BSP module of Rev.5.00 or higher."
#endif

/**********************************************************************************************************************
 Macro definitions
 **********************************************************************************************************************/
/* To use for 64-byte alignment address checking, calculation */
#define GLCDC_ADDRESS_ALIGNMENT_64B (0x0000003FUL)

/* To use for 2 and 4 pixel alignment checking, calculation */
#define ALIGNMENT_4_MASK            (0x0003U)
#define ALIGNMENT_2_MASK            (0x0001U)

/* To adjust 64 pixel margin calculation */
#define OFFSET_MARGIN_MINUS_64PIX (64)

/* Color look up table entry size */
#define GLCDC_CLUT_ENTRY_SIZE (256)

/* Fixed margin by Hardware operation */
#define BG_PLANE_H_CYC_MARGIN_MIN      (2)      /* Hsync signal margin is 2 */
#define BG_PLANE_V_CYC_MARGIN_MIN      (1)      /* Vsync signal margin is 1 */

/* Panel timing, Maximum threshold */
#define BG_PLANE_H_CYC_MAX                (1024)        /* BG_PERI.FH (Max=1024) */
#define BG_PLANE_V_CYC_MAX                (1024)        /* BG_PERI.FV (Max=1024) */
#define BG_PLANE_H_CYC_ACTIVE_SIZE_MAX    (1016)        /* BG_HSIZE.HW (Max=1016) */
#define BG_PLANE_V_CYC_ACTIVE_SIZE_MAX    (1020)        /* BG_VSIZE.VW (Max=1020) */
#define BG_PLANE_H_ACTIVE_POS_MAX         (1006)        /* BG_HSIZE.HP (Max=1006) */
#define BG_PLANE_V_ACTIVE_POS_MAX         (1007)        /* BG_VSIZE.VP (Max=1007) */
#define GR_PLANE_LNOFF_POS_MAX            (32767)       /* GRn_FLM3_LNOFF(positive num max=32767) */
#define GR_PLANE_H_START_POS_MAX          (1005)        /* GRn_AB3_GRCHS (Max=1005) */
#define GR_PLANE_V_START_POS_MAX          (1006)        /* GRn_AB2_GRCVS (Max=1006) */
#define GR_PLANE_H_CYC_ACTIVE_SIZE_MAX    (1016)        /* GRn_AB3_GRCHW (Max=1016) */
#define GR_PLANE_V_CYC_ACTIVE_SIZE_MAX    (1020)        /* GRn_AB3_GRCVW (Max=1020) */
#define GR_PLANE_H_ACTIVE_POS_MAX         (1005)        /* GRn_AB2.GRCHS (Min=1005) */
#define GR_PLANE_V_ACTIVE_POS_MAX         (1006)        /* GRn_AB2.GRCVS (Min=1006) */
#define GR_PLANE_DATANUM_POS_MAX          (65536)       /* GRn_FLM5_DATANUM (Max=65536) */
#define GR_BLEND_H_ACTIVE_POS_MAX         (1005)        /* GRn_AB5_GRCHS (Max=1005) */
#define GR_BLEND_V_ACTIVE_POS_MAX         (1006)        /* GRn_AB4_GRCVS (Max=1006) */
#define GR_BLEND_H_CYC_ACTIVE_SIZE_MAX    (1016)        /* GRn_AB5_GRCHW (Max=1016) */
#define GR_BLEND_V_CYC_ACTIVE_SIZE_MAX    (1020)        /* GRn_AB4_GRCVW (Max=1020) */
#define BG_BGSYNC_HP_MAX                  (15)          /*BGSYNC_HP (Max=15)*/
#define BG_BGSYNC_VP_MAX                  (15)          /*BGSYNC_VP (Max=15)*/

