renesas/rx72n-envision-kit/vendors/renesas/boards/rx72n-envision-kit/aws_demos/src/smc_gen/r_glcdc_rx/src/r_glcdc_private.h
/***********************************************************************************************************************
 Exported global functions (to be accessed by other files)
 **********************************************************************************************************************/

#if (GLCDC_CFG_PARAM_CHECKING_ENABLE)
glcdc_err_t r_glcdc_open_param_check(glcdc_cfg_t const * const p_cfg);
glcdc_err_t r_glcdc_param_check_layer(glcdc_runtime_cfg_t const * const p_runtime);
glcdc_err_t r_glcdc_param_check_clut(glcdc_clut_cfg_t const * const p_clut);
glcdc_err_t r_glcdc_param_check_brightness(glcdc_brightness_t const * const p_brightness);
glcdc_err_t r_glcdc_param_check_gamma(glcdc_gamma_correction_t const * const p_gamma);
#endif

/* Enabled when GLCDC_CFG_CONFIGURATION_MODE is set to "1" or using QE for Display[RX] */
/* QE for Display[RX] adds the macro definition "QE_DISPLAY_CONFIGURATION" to the compile options. */
#if ((GLCDC_CFG_CONFIGURATION_MODE) || defined(QE_DISPLAY_CONFIGURATION))

void r_glcdc_qe_parameters_setting(glcdc_cfg_t * const p_glcdc_qe_cfg);

#if (LCD_CH0_CLUT_GR2_ENABLE == true)
extern uint32_t LCD_CH0_CLUT_GR2_PBASE[];
#endif

#if (LCD_CH0_CLUT_GR1_ENABLE == true)
extern uint32_t LCD_CH0_CLUT_GR1_PBASE[];
#endif

#if (LCD_CH0_CALLBACK_ENABLE == true)
/* callback function prototype declaration */
void LCD_CH0_PCALLBACK (void *);
#define GLCDC_PRV_PCALLBACK ((void (*)(void *))LCD_CH0_PCALLBACK)
#else
#define GLCDC_PRV_PCALLBACK (FIT_NO_FUNC)
#endif

#endif


void r_glcdc_clock_set(glcdc_cfg_t const * const p_cfg);
void r_glcdc_sync_signal_set(glcdc_cfg_t const * const p_cfg);
void r_glcdc_background_screen_set(glcdc_cfg_t const * const p_cfg);
void r_glcdc_blend_condition_set(glcdc_blend_t const * const p_blend, glcdc_frame_layer_t frame);

void r_glcdc_graphics_layer_set(glcdc_input_cfg_t const * const p_input, glcdc_frame_layer_t frame);
void r_glcdc_graphics_chromakey_set(glcdc_chromakey_t const * const p_chromakey, glcdc_frame_layer_t frame);
void r_glcdc_output_block_set(glcdc_cfg_t const * const p_cfg);
void r_glcdc_brightness_correction(glcdc_brightness_t const * const p_brightness);
void r_glcdc_contrast_correction(glcdc_contrast_t const * const p_contrast);
void r_glcdc_gamma_correction(glcdc_gamma_correction_t const * const p_gamma);

void r_glcdc_detect_setting(glcdc_detect_cfg_t const * const p_detection);
void r_glcdc_interrupt_setting(glcdc_interrupt_cfg_t const * const p_interrupt);

void r_glcdc_graphics_read_enable(void);
void r_glcdc_bg_color_setting(glcdc_color_t const * const p_color);

void r_glcdc_power_on(void);
void r_glcdc_power_off(void);
void r_glcdc_release_software_reset(void);
void r_glcdc_software_reset(void);
void r_glcdc_clut_update(glcdc_clut_cfg_t const * const p_clut, glcdc_frame_layer_t frame);
void r_glcdc_clut_set(glcdc_frame_layer_t frame, glcdc_clut_plane_t clut_plane, uint32_t entry, uint32_t data);
void r_glcdc_bg_operation_enable(void);
void r_glcdc_bg_operation_disable(void);
bool r_glcdc_is_register_reflecting(void);
void r_glcdc_output_ctrl_update(void);
bool r_glcdc_is_output_ctrl_updating(void);
void r_glcdc_line_detect_number_set(uint32_t line);
bool r_glcdc_is_fading(glcdc_frame_layer_t frame);
glcdc_clut_plane_t r_glcdc_is_clutplane_selected(glcdc_frame_layer_t frame);

void r_glcdc_clutplane_select(glcdc_frame_layer_t frame, glcdc_clut_plane_t clut_plane);
void r_glcdc_gr_plane_update(glcdc_frame_layer_t frame);
bool r_glcdc_is_gr_plane_updating(glcdc_frame_layer_t frame);
void r_glcdc_gamma_update(void);
bool r_glcdc_is_gamma_updating(void);
bool r_glcdc_vpos_int_status_check(void);
bool r_glcdc_gr1uf_int_status_check(void);
bool r_glcdc_gr2uf_int_status_check(void);
void r_glcdc_vpos_int_status_clear(void);
void r_glcdc_gr1uf_int_status_clear(void);
void r_glcdc_gr2uf_int_status_clear(void);

void r_glcdc_line_detect_isr(void);
void r_glcdc_underflow_1_isr(void);
void r_glcdc_underflow_2_isr(void);

#endif /* R_GLCDC_PRIVATE_H */
